#!/usr/bin/perl


################################################################################################################################################################################
# 当プログラムの著作権は(株)スタジオキャンビーが保有しています。
# プログラムの改変・改良は自由ですが、コピーして利用する事を禁じます。
# 
# Copyright(C) Studio Canbe Corp. All rights reserved.
# Delivered: 2010-02-22
################################################################################################################################################################################


##########    ライブラリインポート    ##########
# CGI共通ライブラリのインポート
require			"../common/common.pl";

# 日本語コード変換ライブラリのインポート
require			"../common/jcode.pl";


##########         メイン処理         ##########
MAIN:{
	&decode;

	$FORM{'enc_p'} = &url_encode($FORM{'p'});

	$FORM{'url'} = "";
	$FORM{'url_input'} = "";
	if($FORM{'p'}){
		$FORM{'url'} = 'https://www.fmi.co.jp/outlet_form/form.cgi?p=' . $FORM{'enc_p'};
		$FORM{'url_input'} = "<input type=\"text\" name=\"url\" value=\"$FORM{'url'}\" onblur=\"this.style.backgroundColor='#FFFFFF';\" onfocus=\"this.style.backgroundColor='#E5ECF9';\" onclick=\"this.form.url.select();\" class=\"input2\" />";
		$FORM{'url_anchor'} = "<a href=\"$FORM{'url'}\" target=\"_blank\">$FORM{'p'}</a>";
	}

	&index_html;
}


################################################################################################################################################################################
##################################################                                SUB ROUTINE                                 ##################################################
################################################################################################################################################################################


################################################################################################################################################################################
##################################################                                    HTML                                    ##################################################
################################################################################################################################################################################


##########         入力ページ         ##########
sub index_html
{
##●引数
##	なし

##●戻り値
##	なし

##●ローカル変数
	my(@data);
	my($output_html);

##●処理

##●HTMLデータ作成

##●テンプレートファイル読み込み、タグの置換
	$output_html = join("", &fread("__index.html", 0, 1));

##	置換:###
	foreach my $key(sort keys %FORM){
		$output_html =~ s/###$key###/$FORM{$key}/sg;
	}

##	置換:例外処理

##	置換:空データ
	$output_html =~ s/###.+?###//sg;

##●ページ出力
	print <<EOM;
Content-type: text/html
Pragma: no-cache
Cache-Control: no-cache
Expires: Thu, 01 Dec 1994 16:00:00 GMT

$output_html
EOM
	exit;
}


__END__